In [1]:
import numpy as np

In [3]:
matrix = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]])

In [4]:
matrix.reshape(2, 6)

array([[ 1,  2,  3,  4,  5,  6],
       [ 7,  8,  9, 10, 11, 12]])

In [5]:
matrix.reshape(1, -1)

array([[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12]])

In [6]:
import pandas as pd

In [9]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'

In [10]:
dataframe = pd.read_csv(url)

In [12]:
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [13]:
dataframe.shape

(1313, 6)

In [15]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [16]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [18]:
dataframe[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [19]:
dataframe.iloc[1000:1004]

                       Name PClass  Age     Sex  Survived  SexCode
1000      McCoy, Miss Agnes    3rd  NaN  female         0        1
1001      McCoy, Miss Alice    3rd  NaN  female         0        1
1002      McCoy, Mr Bernard    3rd  NaN    male         0        0
1003  McDermott, Miss Delia    3rd  NaN  female         0        1

In [20]:
dataframe.iloc[1000:1004].index

RangeIndex(start=1000, stop=1004, step=1)

In [21]:
dataframe.index.name

In [22]:
# loc is useful when the index of the dataframe is a label
dataframe = dataframe.set_index(dataframe['Name'])

In [23]:
dataframe.index.name

'Name'

In [24]:
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [25]:
dataframe.iloc['Allen, Miss Elisabeth Walton']

TypeError: Cannot index by location index with a non-integer key

In [26]:
dataframe = pd.read_csv(url)
dataframe.loc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [28]:
dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [29]:
dataframe[dataframe['Sex'] == 'female'].shape

(462, 6)

In [42]:
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'].notna())]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
...,...,...,...,...,...,...
1276,"Van Impe, Miss Catharine",3rd,10.0,female,0,1
1278,"Van Impe, Mrs Jean Baptiste",3rd,30.0,female,0,1
1283,"Vestrom, Miss Hulda Amanda Adolfina",3rd,14.0,female,0,1
1293,"Wilkes, Mrs Ellen",3rd,45.0,female,1,1
1304,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1

In [43]:
dataframe[(dataframe['Sex'] == 'female') | (dataframe['Age'].notna())]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [44]:
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [45]:
temp = dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)]

In [46]:
temp

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

In [47]:
del temp

In [50]:
dataframe['Sex'].replace(['female', 'male'], ['Woman', 'Man']).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [51]:
dataframe.replace(1, 'One').head(2)

                           Name PClass   Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female      One     One
1   Allison, Miss Helen Loraine    1st   2.0  female        0     One

In [52]:
dataframe['Sex'].head()

0    female
1    female
2      male
3    female
4      male
Name: Sex, dtype: object

In [53]:
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [54]:
dataframe['Age'].mean()

30.397989417989418

In [55]:
dataframe['Age'].min()

0.17

In [56]:
dataframe['Age'].max()

71.0

In [57]:
dataframe['Age'].sum()

22980.88

In [58]:
dataframe['Age'].count()

756

In [66]:
for x in dataframe.columns:
    print(dataframe.rename(columns={x: x.lower()}).head(2))

                           name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1
                           Name pclass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1
                           Name PClass   age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1
                           Name PClass   Age     sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1
                           Name PClass   Age     Sex  survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1
                           Name PClass   Age     Sex  Survived  sexcode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [68]:
new_cols = {x:x.lower() for x in dataframe.columns}
new_cols

{'Name': 'name',
 'PClass': 'pclass',
 'Age': 'age',
 'Sex': 'sex',
 'Survived': 'survived',
 'SexCode': 'sexcode'}

In [69]:
dataframe.rename(columns=new_cols).head(2)

                           name pclass   age     sex  survived  sexcode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [71]:
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [72]:
dataframe[dataframe['Age'].isnull()].count()

Name        557
PClass      557
Age           0
Sex         557
Survived    557
SexCode     557
dtype: int64

In [74]:
dataframe['Sex'].replace('male', np.nan).head(5)

0    female
1    female
2       NaN
3    female
4       NaN
Name: Sex, dtype: object

In [75]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [76]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [77]:
dataframe['Sex'].nunique()

2

In [78]:
dataframe['Sex'].value_counts(dropna=False)

male      851
female    462
Name: Sex, dtype: int64

In [79]:
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [80]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [82]:
dataframe.groupby('Survived')['Age'].mean()

Survived
0    31.131670
1    29.359585
Name: Age, dtype: float64

In [83]:
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [84]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [85]:
def uppercase(x):
    return x.upper()

In [86]:
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [87]:
dataframe['Name'].map(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [88]:
dataframe.groupby('Sex').apply(lambda x:x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [90]:
data_a = {'id': ['1', '2', '3'],
        'first': ['Alex', 'Amy', 'Allen'],
        'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns=['id', 'first', 'last'])

In [91]:
data_b = {'id': ['4', '5', '6'],
        'first': ['Billy', 'Brian', 'Bran'],
        'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

In [92]:
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [93]:
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [94]:
data_a = {'emp_id': ['1', '2', '3'],
        'first': ['Alex', 'Amy', 'Allen'],
        'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns=['emp_id', 'first', 'last'])

data_b = {'id': ['4', '5', '6'],
        'first': ['Billy', 'Brian', 'Bran'],
        'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns=['id', 'first', 'last'])

In [95]:
pd.concat([dataframe_a, dataframe_b], axis=0)

  emp_id  first      last   id
0      1   Alex  Anderson  NaN
1      2    Amy  Ackerman  NaN
2      3  Allen       Ali  NaN
0    NaN  Billy    Bonder    4
1    NaN  Brian     Black    5
2    NaN   Bran   Balwner    6

In [96]:
pd.concat([dataframe_a, dataframe_b], axis=1)

  emp_id  first      last id  first     last
0      1   Alex  Anderson  4  Billy   Bonder
1      2    Amy  Ackerman  5  Brian    Black
2      3  Allen       Ali  6   Bran  Balwner

In [97]:
employee_data = {'employee_id': ['1', '2', '3', '4'],
                'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}

dataframe_employees = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

In [98]:
sales_data = {'employee_id': ['3', '4', '5', '6'],
            'total_sales': [23456, 2512, 2345, 1455]}

dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

In [99]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [100]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [101]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='inner')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [102]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [103]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455

In [104]:
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [105]:
pd.merge(dataframe_employees, dataframe_sales, left_index=True, right_index=True)

  employee_id_x        name employee_id_y  total_sales
0             1   Amy Jones             3        23456
1             2  Allen Keys             4         2512
2             3  Alice Bees             5         2345
3             4  Tim Horton             6         1455